/* 
   Log.strings
   BluetoothRemoteFramework

   Created by Marcel Erz on 8/14/08.
   Copyright 2008 Eliah Project. All rights reserved.
 */

// Inquiry
"1" = "Start search.";
"2" = "Start searching...";
"3" = "Cancel search.";
"4" = "Search cancelled.";
"5" = "Found Wiimote '%@'.";
"6" = "Connecting to device '%@'.";
"7" = "Connected to '%@'.";
"8" = "Denied to connect to device '%@'.";
"9" = "Found Wii-BalanceBoard '%@'.";
"10" = "Found BD-Remote '%@'.";
"11" = "Device found '%@'.";
"12" = "Unknown or unwanted device '%@'.";
"13" = "Device '%@' connected. Found in auto-connect list.";
"14" = "Device '%@' connected. Not found in auto-connect list.";
"15" = "Device name updated: '%@'.";
"16" = "Search completed.";
"17" = "Filter set to %d.";
"18" = "Search was aborted by the system.";

// BluetoothRemoteDevice
"51" = "Opening connection to '%@'.";
"52" = "Closing connection to '%@'.";
"53" = "Open channel.";
"54" = "Closing channel.";
"55" = "Channel closed.";
"56" = "Received data (length %d) without connection.";
"57" = "Received data with length %d.";
"58" = "Sending data with length %d to channel %d.";

// Wiimote


// BDRemote
"150" = "Init BD-Remote";